Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresInfo.GetRevisionDate Method
 Returns the Tekla Structures revision date as string.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static string GetRevisionDate()
Public Shared Function GetRevisionDate As String
Return Value
Type: String
The current revision date of Tekla Structures.
See Also
Reference
TeklaStructuresInfo Class
Tekla.Structures Namespace